In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
from sklearn.model_selection import train_test_split

In [3]:
df = pd.read_csv(r"C:\Users\khushi pawar\Downloads\train (2).csv",usecols=['Age','Fare','Survived'])

In [4]:
df.isnull().mean()*100

Survived     0.00000
Age         19.86532
Fare         0.00000
dtype: float64

In [5]:
df.head(3)

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250

In [6]:
X = df.iloc[:,1:]
Y = df.iloc[:,0]

In [7]:
X_train,X_test,y_train,y_test=train_test_split(X,Y,test_size=0.2,random_state=22)

In [8]:
X_train

      Age      Fare
793   NaN   30.6958
814  30.5    8.0500
43    3.0   41.5792
269  35.0  135.6333
538   NaN   14.5000
..    ...       ...
358   NaN    7.8792
356  22.0   55.0000
812  35.0   10.5000
132  47.0   14.5000
885  39.0   29.1250

[712 rows x 2 columns]

In [9]:
X_train['Age_train_imputed'] = X_train['Age']
X_test['Age_test_imputed'] = X_test['Age']

In [10]:
X_train

      Age      Fare  Age_train_imputed
793   NaN   30.6958                NaN
814  30.5    8.0500               30.5
43    3.0   41.5792                3.0
269  35.0  135.6333               35.0
538   NaN   14.5000                NaN
..    ...       ...                ...
358   NaN    7.8792                NaN
356  22.0   55.0000               22.0
812  35.0   10.5000               35.0
132  47.0   14.5000               47.0
885  39.0   29.1250               39.0

[712 rows x 3 columns]

In [11]:
X_test['Age'].isnull().sum()

np.int64(30)

In [12]:
X_train['Age_train_imputed'][X_train['Age_train_imputed'].isnull()]

793   NaN
538   NaN
468   NaN
778   NaN
284   NaN
       ..
680   NaN
557   NaN
596   NaN
502   NaN
358   NaN
Name: Age_train_imputed, Length: 147, dtype: float64

In [13]:
X_train['Age'].dropna()

814    30.5
43      3.0
269    35.0
890    32.0
543    32.0
       ...
491    21.0
356    22.0
812    35.0
132    47.0
885    39.0
Name: Age, Length: 565, dtype: float64

**X_train['Age_train_imputed'][X_train['Age_train_imputed'].isnull()]**
**---isse is col ka data aaiga---,,,,----isse sari null value aa jaigi-----**

**X_train['Age'].dropna()**
**isse sari nan value drop kr ke age col dega**

**sample(X_train['Age'].isnull().sum())**
**jitni nan value hai utna random value de dega**

**sample(X_train['Age'].isnull().sum()).values()**
**nan value pr set kr dega random value**

In [14]:
X_train['Age_train_imputed'][X_train['Age_train_imputed'].isnull()] = X_train['Age'].dropna().sample(X_train['Age'].isnull().sum()).values

C:\Users\khushi pawar\AppData\Local\Temp\ipykernel_6852\3356548583.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  X_train['Age_train_imputed'][X_train['Age_train_imputed'].isnull()] = X_train['Age'].dropna().sample(X_train['Age'].isnull().sum()).values

In [15]:
X_test['Age_test_imputed'][X_test['Age_test_imputed'].isnull()]=X_test['Age'].dropna().sample(X_test['Age'].isnull().sum()).values

C:\Users\khushi pawar\AppData\Local\Temp\ipykernel_6852\1644879055.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  X_test['Age_test_imputed'][X_test['Age_test_imputed'].isnull()]=X_test['Age'].dropna().sample(X_test['Age'].isnull().sum()).values

In [16]:
X_test['Age'].dropna().sample(X_test['Age'].isnull().sum()).values

array([50. , 21. , 54. , 36.5, 31. , 25. , 23. , 26. , 18. , 52. , 20. ,
       22. , 15. , 24. , 17. ,  9. , 46. , 24. , 43. , 24. , 36. , 19. ,
       41. , 37. , 15. , 30. , 33. , 54. , 25. , 20. ])

In [17]:
X_test['Age_test_imputed'][X_test['Age_test_imputed'].isnull()]

Series([], Name: Age_test_imputed, dtype: float64)

In [18]:
X_train

      Age      Fare  Age_train_imputed
793   NaN   30.6958               22.0
814  30.5    8.0500               30.5
43    3.0   41.5792                3.0
269  35.0  135.6333               35.0
538   NaN   14.5000                2.0
..    ...       ...                ...
358   NaN    7.8792                2.0
356  22.0   55.0000               22.0
812  35.0   10.5000               35.0
132  47.0   14.5000               47.0
885  39.0   29.1250               39.0

[712 rows x 3 columns]

In [19]:
X_test

      Age      Fare  Age_test_imputed
816  23.0    7.9250              23.0
789  46.0   79.2000              46.0
869   4.0   11.1333               4.0
235   NaN    7.5500               4.0
473  23.0   13.7917              23.0
..    ...       ...               ...
341  24.0  263.0000              24.0
389  17.0   12.0000              17.0
691   4.0   13.4167               4.0
698  49.0  110.8833              49.0
463  48.0   13.0000              48.0

[179 rows x 3 columns]